app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE (USA)
---
  def index
    @products = Product.all

INSERT INTO "products" ("name", "cost", "country_of_origin") VALUES ($1, $2, $3) RETURNING "id"  [["name", "newew"], ["cost", 3.0], ["country_of_origin", "asdfsdfsdf"]]
---
  def create
    @product = Product.new(product_params)
    if @product.save

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 216], ["LIMIT", 1]]
UPDATE "products" SET "cost" = $1 WHERE "products"."id" = $2  [["cost", 5.5], ["id", 263]]
---
  def update
    @product = Product.find(params[:id])
    if @product.update(product_params)