app/controllers/reviews_controller.rb

  def index
    @reviews = nil
    @filter_review = Review.new
    if params.key?(:review)
      search_author = params[:review][:author]
      search_rating = params[:review][:rating]
      @reviews = Review.filter_by(search_author, search_rating)
    else
      @reviews = Review.all
---
SELECT "reviews".* FROM "reviews" WHERE (author like '%Ann%') AND "reviews"."rating" = $1  [["rating", 1]]

  def create
    @product = Product.find(params[:product_id])
    @review = @product.reviews.new(review_params)
    @review.user_id = current_user.id
    if @review.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("author", "content_body", "rating", "product_id", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author", "jBen"], ["content_body", "asdfkkjasdflkjasdfkljsdflkjsdflaksdjfasdkfjasdlfkjasdflkasdjfalsdkfjasd"], ["rating", 3], ["product_id", 160], ["user_id", 1]]