app/controllers/reviews_controller.rb

  def index
    if current_user
      @user = current_user
      @reviews = Review.where(user_id: current_user.id)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = $1  [["user_id", 1]]