app/models/product.rb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = $1  [["product_id", 162]]
---
  def calc_avg_rating()
    if self.reviews.length == 0