app/views/products/show.html.erb

<h3>Product Reviews</h3>
<% if @product.reviews.any? %>
  <ol>
    <% @product.reviews.each do |review| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = $1  [["product_id", 1]]
SELECT  1 AS one FROM "reviews" WHERE "reviews"."product_id" = $1 LIMIT $2  [["product_id", 1], ["LIMIT", 1]]