app/views/reviews/index.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = $1  [["user_id", 1]]
SELECT "reviews".* FROM "reviews" WHERE (author like '%Ann%') AND "reviews"."rating" = $1  [["rating", 1]]
---
<h4>email: <%= @user.email %></h4>
<h4>Number of Reviews: <%= @user.reviews.length%></h4>
<h4>Avg Rating: <%= @user.reviews.length%></h4>

SELECT  1 AS one FROM "reviews" LIMIT $1  [["LIMIT", 1]]
SELECT "reviews".* FROM "reviews"
---

<% if @user.reviews.any? %>
  <ol>
    <% @user.reviews.each do |review| %>